{
    "Japan-1980": {
        "flag_emoji": "🇯🇵",
        "population": 117000000,
        "gdp": 1100.0,
        "military_strength": 250.0,
        "political_stability": 85.0,
        "industrialization_level": 5,
        "tech_level": 5,
        "briefing": "In 1980, Japan stands at the apex of its post‑war economic miracle, boasting a GDP that places it among the world's top economies. However, the nation faces immediate challenges: an aging demographic that threatens future labor supply, a widening trade deficit with the United States, and the need to modernize its industrial base to stay competitive in emerging high‑tech sectors. Additionally, regional security concerns—particularly the Soviet naval presence in the Pacific and the volatile situation on the Korean Peninsula—require careful diplomatic balancing while maintaining a credible self‑defence posture.\n\nDomestically, the government must address rising public debt and inflationary pressures while steering reforms in education and research to sustain technological leadership. Infrastructure upgrades, especially in energy and transportation, are essential to support continued growth. Internationally, Japan seeks to deepen its role in multilateral institutions such as the GATT and the newly formed International Monetary Fund reforms, while navigating the strategic rivalry between the United States and the Soviet Union that defines the Cold‑War era.",
        "regional_neighbors": {
            "Russia (USSR)": 900.0,
            "China": 600.0,
            "South Korea": 300.0,
            "North Korea": 200.0
        },
        "world_gdp": {
            "United States": 2860,
            "Soviet Union": 1200,
            "West Germany": 1000,
            "France": 600,
            "Italy": 500,
            "United Kingdom": 500,
            "Canada": 300,
            "Brazil": 200,
            "Spain": 150,
            "Australia": 140
        },
        "world_military": {
            "Soviet Union": 950,
            "United States": 900,
            "China": 600,
            "France": 500,
            "United Kingdom": 450,
            "India": 400,
            "North Korea": 350,
            "South Korea": 300,
            "West Germany": 250,
            "Italy": 200
        }
    },
    "Japan-1985": {
        "flag_emoji": "🇯🇵",
        "population": 121000000,
        "gdp": 3100.0,
        "military_strength": 300.0,
        "political_stability": 80.0,
        "industrialization_level": 5,
        "tech_level": 5,
        "briefing": "Japan in 1985 stands at the height of its post‑war economic miracle, commanding a GDP of roughly $3.1 trillion and a highly diversified industrial base ranging from automotive to electronics. The government must now navigate mounting trade frictions with the United States, a burgeoning asset‑price bubble, and the need to transition from export‑driven growth to a more balanced domestic consumption model. \n\nOn the security front, Japan’s Self‑Defense Forces remain modest in size and capability, constrained by constitutional limits and a regional environment marked by the Soviet Union’s naval expansion, China’s gradual military modernization, and the volatile Korean Peninsula. Immediate challenges include reinforcing maritime surveillance, securing supply chains for critical technologies, and maintaining diplomatic leverage with key allies while preserving internal political stability.",
        "regional_neighbors": {
            "South Korea": 250.0,
            "China": 600.0,
            "Russia (USSR)": 900.0,
            "North Korea": 150.0
        },
        "world_gdp": {
            "United States": 4000.0,
            "Soviet Union": 2200.0,
            "West Germany": 1200.0,
            "France": 800.0,
            "Italy": 600.0,
            "United Kingdom": 550.0,
            "Canada": 350.0,
            "Brazil": 300.0,
            "Spain": 250.0,
            "Australia": 200.0
        },
        "world_military": {
            "Soviet Union": 900.0,
            "United States": 850.0,
            "China": 600.0,
            "France": 400.0,
            "United Kingdom": 350.0,
            "West Germany": 300.0,
            "South Korea": 250.0,
            "India": 200.0,
            "Italy": 180.0,
            "Canada": 150.0
        }
    }
}