{
    "United States-1980": {
        "flag_emoji": "🇺🇸",
        "population": 226500000,
        "gdp": 2789.0,
        "military_strength": 960.0,
        "political_stability": 70.0,
        "briefing": "Good morning, Mr. President. Our nation faces a confluence of pressing challenges both domestically and abroad. Economically, we are grappling with severe stagflation, characterized by high unemployment, persistent inflation nearing double digits, and soaring interest rates that are stifling investment and consumer spending. The ongoing energy crisis continues to impact our industries and households, exacerbating economic anxieties. Furthermore, the protracted Iran Hostage Crisis remains a significant diplomatic and humanitarian concern, demanding a swift and honorable resolution that restores American prestige on the global stage.\n\nInternationally, the Soviet invasion of Afghanistan has heightened Cold War tensions, requiring a firm and strategic response to contain Soviet expansionism and reassure our allies. Domestically, there is a growing sense of public frustration over economic woes and our perceived diminished influence abroad. As we approach an election year, maintaining national unity and confidence will be paramount while simultaneously addressing the fundamental economic structural issues and securing the release of our citizens held in Tehran.",
        "world_gdp": {
            "Soviet Union": 1500.0,
            "Japan": 1065.0,
            "West Germany": 839.0,
            "France": 686.0,
            "United Kingdom": 539.0,
            "Italy": 423.0,
            "China": 300.0,
            "Canada": 282.0,
            "Brazil": 240.0,
            "Spain": 220.0
        },
        "world_military": {
            "Soviet Union": 970.0,
            "China": 480.0,
            "West Germany": 400.0,
            "France": 380.0,
            "United Kingdom": 360.0,
            "India": 250.0,
            "Israel": 230.0,
            "North Korea": 210.0,
            "Egypt": 200.0,
            "Turkey": 190.0
        }
    },
    "Japan-1980": {
        "flag_emoji": "🇯🇵",
        "population": 116800000,
        "gdp": 1060.0,
        "military_strength": 450.0,
        "political_stability": 92.0,
        "briefing": "Economic prosperity is undeniable, yet our resource dependency remains a critical vulnerability, particularly in the wake of the recent global energy shocks. While our technological prowess and export-driven industries continue to expand, we must navigate increasing trade friction with Western partners, especially the United States and European nations, who view our surging competitiveness with growing concern. Maintaining this delicate balance between growth and global economic harmony will be paramount for sustained national success.\n\nGeopolitically, the Cold War casts a long shadow over East Asia. The Soviet Union's significant military presence in the Far East, combined with an unpredictable North Korea and a modernizing China, presents a complex security landscape. Our alliance with the United States is the cornerstone of our defense, but we must continually assess our own self-defense capabilities within the confines of our pacifist constitution. Strengthening regional stability through diplomatic initiatives, while carefully managing our relationship with our primary protector, will require astute statecraft.",
        "world_gdp": {
            "United States": 2790.0,
            "Soviet Union": 1140.0,
            "West Germany": 820.0,
            "France": 680.0,
            "United Kingdom": 530.0,
            "Italy": 440.0,
            "China": 300.0,
            "Canada": 300.0,
            "Brazil": 230.0,
            "Spain": 220.0
        },
        "world_military": {
            "United States": 1000.0,
            "Soviet Union": 950.0,
            "China": 680.0,
            "United Kingdom": 520.0,
            "France": 510.0,
            "West Germany": 490.0,
            "India": 420.0,
            "Israel": 410.0,
            "Egypt": 390.0,
            "North Korea": 370.0
        }
    },
    "Philippines-1990": {
        "flag_emoji": "🇵🇭",
        "population": 62600000,
        "gdp": 47.7,
        "military_strength": 180.0,
        "political_stability": 45.0,
        "briefing": "Esteemed Cabinet members, we face a complex tapestry of immediate challenges. On the political and security front, the persistent threat of internal conflict remains paramount. The communist insurgency by the New People's Army continues to destabilize rural areas, while separatist movements in Mindanao demand our careful attention. Furthermore, the specter of past coup attempts against the nascent democratic government highlights the fragility of our political institutions and the urgent need to consolidate civilian control over the military. Building national unity and trust in governance is crucial to ensuring long-term stability and deterring any future challenges to our democratic mandate.\n\nEconomically, the nation grapples with significant hurdles. High levels of foreign debt, widespread poverty, and underemployment continue to burden our populace. Critical infrastructure, particularly in transportation and energy, requires substantial investment to unlock our full economic potential. We must also contend with our inherent vulnerability to natural disasters, which frequently disrupt livelihoods and development efforts. Our immediate focus must be on implementing reforms to attract foreign investment, stimulate job creation, alleviate poverty, and build resilience against external shocks, while ensuring equitable distribution of growth benefits across all regions.",
        "world_gdp": {
            "United States": 5979.6,
            "Japan": 3132.8,
            "West Germany": 1777.6,
            "France": 1229.0,
            "United Kingdom": 1084.1,
            "Italy": 1018.6,
            "Canada": 579.5,
            "Spain": 508.8,
            "Soviet Union": 513.0,
            "China": 398.0
        },
        "world_military": {
            "United States": 980.0,
            "Soviet Union": 950.0,
            "United Kingdom": 720.0,
            "France": 700.0,
            "China": 650.0,
            "West Germany": 600.0,
            "India": 480.0,
            "Japan": 450.0,
            "Israel": 420.0,
            "Italy": 380.0
        }
    }
}